## Dataframes

### Semelhante ao Excel - Tabelas

In [1]:
import numpy as np
import pandas as pd

In [41]:
from numpy.random import randn
np.random.seed(50)

In [43]:
df = pd.DataFrame(randn(5,4), index = 'A B C D E'.split(), columns = 'W X Y Z'.split())

In [44]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

### Seleção e Indexação

In [45]:
df['W']

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [46]:
df[['W','Z']]

          W         Z
A -1.560352 -1.464580
B  1.411946  1.070268
C -1.282293  0.862194
D  0.696737  1.598908
E  3.314075  0.742785

In [50]:
df.W

A   -1.560352
B    1.411946
C   -1.282293
D    0.696737
E    3.314075
Name: W, dtype: float64

In [51]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [53]:
df['Novo'] = df['W'] - df['X']

In [54]:
df

          W         X         Y         Z      Novo
A -1.560352 -0.030978 -0.620928 -1.464580 -1.529375
B  1.411946 -0.476732 -0.780469  1.070268  1.888678
C -1.282293 -1.327479  0.126338  0.862194  0.045186
D  0.696737 -0.334565 -0.997526  1.598908  1.031302
E  3.314075  0.987770  0.123866  0.742785  2.326305

In [55]:
 df.drop('Novo', axis = 1)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [56]:
df

          W         X         Y         Z      Novo
A -1.560352 -0.030978 -0.620928 -1.464580 -1.529375
B  1.411946 -0.476732 -0.780469  1.070268  1.888678
C -1.282293 -1.327479  0.126338  0.862194  0.045186
D  0.696737 -0.334565 -0.997526  1.598908  1.031302
E  3.314075  0.987770  0.123866  0.742785  2.326305

In [57]:
 df.drop('Novo', axis = 1, inplace = True)

In [58]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [59]:
df.drop('C', axis = 0)

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [60]:
df.loc['B']

W    1.411946
X   -0.476732
Y   -0.780469
Z    1.070268
Name: B, dtype: float64

In [63]:
df.iloc[2]

W   -1.282293
X   -1.327479
Y    0.126338
Z    0.862194
Name: C, dtype: float64

In [64]:
df.loc['D','X']

-0.3345651848953687

In [65]:
df.loc[['A','B','C'], ['X', 'Y']]

          X         Y
A -0.030978 -0.620928
B -0.476732 -0.780469
C -1.327479  0.126338

### Selecao Condicional

In [66]:
df

          W         X         Y         Z
A -1.560352 -0.030978 -0.620928 -1.464580
B  1.411946 -0.476732 -0.780469  1.070268
C -1.282293 -1.327479  0.126338  0.862194
D  0.696737 -0.334565 -0.997526  1.598908
E  3.314075  0.987770  0.123866  0.742785

In [67]:
df > 0

       W      X      Y      Z
A  False  False  False  False
B   True  False  False   True
C  False  False   True   True
D   True  False  False   True
E   True   True   True   True

In [68]:
df[df > 0]

          W        X         Y         Z
A       NaN      NaN       NaN       NaN
B  1.411946      NaN       NaN  1.070268
C       NaN      NaN  0.126338  0.862194
D  0.696737      NaN       NaN  1.598908
E  3.314075  0.98777  0.123866  0.742785

In [69]:
df[df['X'] > 0]

          W        X         Y         Z
E  3.314075  0.98777  0.123866  0.742785

In [71]:
df[(df['W'] >0) & (df['Z'] > 1)]

          W         X         Y         Z
B  1.411946 -0.476732 -0.780469  1.070268
D  0.696737 -0.334565 -0.997526  1.598908